In [1]:
import pandas as pd
import numpy as np

In [2]:
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

### Introduction to pandas Data Structure

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series((4, 7, -5, 3), index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']
obj2['a'] = 420
obj2

d      4
b      7
a    420
c      3
dtype: int64

In [9]:
print(obj2[['a','b']])

a    420
b      7
dtype: int64

In [10]:
print(obj2[['c','d']])

c    3
d    4
dtype: int64

In [11]:
obj2[obj2 > 4]

b      7
a    420
dtype: int64

In [12]:
print(obj2)
print()
print(obj2 * 2)

d      4
b      7
a    420
c      3
dtype: int64

d      8
b     14
a    840
c      6
dtype: int64

In [13]:
print('a' in obj2)

True

In [14]:
sdata = {'Karachi': 75000, 'Lahore': 65000, 'Lasbella': 45000, 'Gadoon': 24000}
obj3 = pd.Series(sdata)
obj3

Karachi     75000
Lahore      65000
Lasbella    45000
Gadoon      24000
dtype: int64

In [15]:
states = ['Lahore', 'Karachi','Gadoon','Gilgit']

In [16]:
obj4 = pd.Series(sdata, index=states)
obj4

Lahore     65000.0
Karachi    75000.0
Gadoon     24000.0
Gilgit         NaN
dtype: float64

In [17]:
pd.isnull(obj4)

Lahore     False
Karachi    False
Gadoon     False
Gilgit      True
dtype: bool

In [18]:
pd.notnull(obj4)

Lahore      True
Karachi     True
Gadoon      True
Gilgit     False
dtype: bool

In [19]:
obj4.isnull()

Lahore     False
Karachi    False
Gadoon     False
Gilgit      True
dtype: bool

In [20]:
print(obj3)
print()

print(obj4)
print()

print(obj3 + obj4)
print()

print(obj4 + obj3)

Karachi     75000
Lahore      65000
Lasbella    45000
Gadoon      24000
dtype: int64

Lahore     65000.0
Karachi    75000.0
Gadoon     24000.0
Gilgit         NaN
dtype: float64

Gadoon       48000.0
Gilgit           NaN
Karachi     150000.0
Lahore      130000.0
Lasbella         NaN
dtype: float64

Gadoon       48000.0
Gilgit           NaN
Karachi     150000.0
Lahore      130000.0
Lasbella         NaN
dtype: float64

In [21]:
obj4.name = 'population'

In [22]:
print(obj4)

Lahore     65000.0
Karachi    75000.0
Gadoon     24000.0
Gilgit         NaN
Name: population, dtype: float64

In [23]:
obj4.index.name = 'city'
obj4

city
Lahore     65000.0
Karachi    75000.0
Gadoon     24000.0
Gilgit         NaN
Name: population, dtype: float64

In [24]:
print(obj)
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [25]:
data = {
    'state': ['Sindh','Sindh','Sindh','Punjab','Punjab','Punjab'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'population': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

frame = pd.DataFrame(data)

In [26]:
frame

    state  year  population
0   Sindh  2000         1.5
1   Sindh  2001         1.7
2   Sindh  2002         3.6
3  Punjab  2001         2.4
4  Punjab  2002         2.9
5  Punjab  2003         3.2

In [27]:
frame.head()

    state  year  population
0   Sindh  2000         1.5
1   Sindh  2001         1.7
2   Sindh  2002         3.6
3  Punjab  2001         2.4
4  Punjab  2002         2.9

In [28]:
pd.DataFrame(data, columns=['year', 'state', 'population'])

   year   state  population
0  2000   Sindh         1.5
1  2001   Sindh         1.7
2  2002   Sindh         3.6
3  2001  Punjab         2.4
4  2002  Punjab         2.9
5  2003  Punjab         3.2

In [29]:
frame2 = pd.DataFrame(data, columns=['year','state','population','debt'],
index=['one','two','three','four','five','six'])

display(frame2)
display(frame2.columns)
display(frame2.index)

       year   state  population debt
one    2000   Sindh         1.5  NaN
two    2001   Sindh         1.7  NaN
three  2002   Sindh         3.6  NaN
four   2001  Punjab         2.4  NaN
five   2002  Punjab         2.9  NaN
six    2003  Punjab         3.2  NaN

Index(['year', 'state', 'population', 'debt'], dtype='object')

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [30]:
frame2['population']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: population, dtype: float64

In [31]:
frame2.state

one       Sindh
two       Sindh
three     Sindh
four     Punjab
five     Punjab
six      Punjab
Name: state, dtype: object

In [32]:
frame2.iloc[1]

year           2001
state         Sindh
population      1.7
debt            NaN
Name: two, dtype: object

In [33]:
frame2.loc['two']

year           2001
state         Sindh
population      1.7
debt            NaN
Name: two, dtype: object

In [34]:
frame2['debt'] = 16.5
frame2

       year   state  population  debt
one    2000   Sindh         1.5  16.5
two    2001   Sindh         1.7  16.5
three  2002   Sindh         3.6  16.5
four   2001  Punjab         2.4  16.5
five   2002  Punjab         2.9  16.5
six    2003  Punjab         3.2  16.5

In [35]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  population  debt
one    2000   Sindh         1.5   0.0
two    2001   Sindh         1.7   1.0
three  2002   Sindh         3.6   2.0
four   2001  Punjab         2.4   3.0
five   2002  Punjab         2.9   4.0
six    2003  Punjab         3.2   5.0

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  population  debt
one    2000   Sindh         1.5   NaN
two    2001   Sindh         1.7  -1.2
three  2002   Sindh         3.6   NaN
four   2001  Punjab         2.4  -1.5
five   2002  Punjab         2.9  -1.7
six    2003  Punjab         3.2   NaN

In [37]:
frame2['eastern'] = frame2.state == 'Sindh'
frame2

       year   state  population  debt  eastern
one    2000   Sindh         1.5   NaN     True
two    2001   Sindh         1.7  -1.2     True
three  2002   Sindh         3.6   NaN     True
four   2001  Punjab         2.4  -1.5    False
five   2002  Punjab         2.9  -1.7    False
six    2003  Punjab         3.2   NaN    False

In [38]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'population', 'debt'], dtype='object')

In [39]:
frame2

       year   state  population  debt
one    2000   Sindh         1.5   NaN
two    2001   Sindh         1.7  -1.2
three  2002   Sindh         3.6   NaN
four   2001  Punjab         2.4  -1.5
five   2002  Punjab         2.9  -1.7
six    2003  Punjab         3.2   NaN

In [40]:
pop = {
    'Punjab': {2001: 2.4, 2002: 2.9},
    'Sindh': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}

frame3 = pd.DataFrame(pop)
frame3

      Punjab  Sindh
2001     2.4    1.7
2002     2.9    3.6
2000     NaN    1.5

In [41]:
frame3.T

        2001  2002  2000
Punjab   2.4   2.9   NaN
Sindh    1.7   3.6   1.5

In [42]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Punjab  Sindh
2001     2.4    1.7
2002     2.9    3.6
2003     NaN    NaN

In [43]:
pdata = {
    'Sindh': frame3['Sindh'][:-1],
    'Punjab': frame3['Punjab'][:2]
}

pd.DataFrame(pdata)

      Sindh  Punjab
2001    1.7     2.4
2002    3.6     2.9

In [44]:
display(frame3)

frame3.index.name = 'year'; frame3.columns.name = 'state'
display(frame3)

      Punjab  Sindh
2001     2.4    1.7
2002     2.9    3.6
2000     NaN    1.5

state  Punjab  Sindh
year
2001      2.4    1.7
2002      2.9    3.6
2000      NaN    1.5

In [45]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### Index Objects

In [46]:
obj = pd.Series(np.arange(3), index=['a','b','c'])
display(obj)

index = obj.index
print(index)
print()

print(index[1:])

a    0
b    1
c    2
dtype: int32

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

index[1] = 'd'

TypeError                                 Traceback (most recent call last)
~\AppData\Local\Temp/ipykernel_1880/3159586693.py in <module>
----> 1 index[1] = 'd'

d:\Program Files\Python37-32\lib\site-packages\pandas\core\indexes\base.py in __setitem__(self, key, value)
   4583     @final
   4584     def __setitem__(self, key, value):
-> 4585         raise TypeError("Index does not support mutable operations")
   4586 
   4587     def __getitem__(self, key):

TypeError: Index does not support mutable operations

In [47]:
labels = pd.Index(np.arange(3))
print(labels)

obj2 = pd.Series([1.5, -2.5, 0], labels)
print(obj2)

obj2.index is labels

Int64Index([0, 1, 2], dtype='int64')
0    1.5
1   -2.5
2    0.0
dtype: float64

True

In [48]:
display(frame3)
print(frame3.columns)

print('Punjab' in frame3.columns)
print(2003 in frame3.index)

state  Punjab  Sindh
year
2001      2.4    1.7
2002      2.9    3.6
2000      NaN    1.5

Index(['Punjab', 'Sindh'], dtype='object', name='state')
True
False

In [49]:
dub_labels = pd.Index(['foo','foo','bar','bar'])
dub_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### Reindexing

In [50]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 =obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [52]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
print(obj3)

obj3.reindex(np.arange(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [53]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), 
index=['a','c','d'], columns=['Ohio','Texas','California'])

display(frame)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [54]:
frame2 = frame.reindex(['a','b','c','d'])
display(frame2)

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [55]:
display(frame)
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [56]:
# frame.loc[['a','c','d'], states]  : ERROR

### Droping Entries from an Axis

In [57]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
print(obj)
print()

new_obj = obj.drop('c')
print(new_obj)
print()

obj.drop(['d','c'])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [58]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
        index=['Ohio','Colorado','Utah','New York'],
        columns=['one','two','three','four'])

display(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
display(data)
data.drop(['Colorado','Ohio'])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
display(data)
data.drop(['Colorado','Ohio'], axis=0)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [61]:
display(data)
data.drop(['Colorado','Ohio'], axis='index')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
display(data)
data.drop('two', axis=1)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
display(data)
data.drop(['two','four'], axis='columns')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [64]:
display(obj)
obj.drop('c', inplace=True)

display(obj)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [67]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [69]:
display(obj['b'])

1.0

In [70]:
obj[1]

1.0

In [75]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [76]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [77]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [78]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [81]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [82]:
obj['b','c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [83]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
    index=['Ohio','Colorado','Utah','New York'],
    columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [86]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [87]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [93]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [96]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [97]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [98]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [99]:
data.loc['Utah','two']

9

In [102]:
display(data.iloc[:,:3])
data.iloc[:,:3][data.three > 5]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [103]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [105]:
ser2 = pd.Series(np.arange(3.), index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [108]:
display(ser[:1])
display(ser.loc[:1])
display(ser.iloc[:1])

0    0.0
dtype: float64

0    0.0
1    1.0
dtype: float64

0    0.0
dtype: float64